In [1]:
import pandas as pd

In [2]:
# Files to load
file_to_load = "2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv"

# Read the CSV into a data frame.
sneakers_df = pd.read_csv(file_to_load)
sneakers_df.head(20)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
5,6,58,882,138,1,credit_card,2017-03-14 15:25:01
6,7,87,915,149,1,cash,2017-03-01 21:37:57
7,8,22,761,292,2,cash,2017-03-08 2:05:38
8,9,64,914,266,2,debit,2017-03-17 20:56:50
9,10,52,788,146,1,credit_card,2017-03-30 21:08:26
10,11,66,848,322,2,credit_card,2017-03-26 23:36:40
11,12,40,983,322,2,debit,2017-03-12 17:58:30
12,13,54,799,266,2,credit_card,2017-03-16 14:15:34
13,14,100,709,111,1,cash,2017-03-22 2:39:49
14,15,87,849,447,3,credit_card,2017-03-10 11:23:18
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
16,17,17,731,176,1,cash,2017-03-21 4:23:38
17,18,28,752,164,1,credit_card,2017-03-21 12:09:07
18,19,83,761,258,2,cash,2017-03-17 13:18:47
19,20,63,898,408,3,credit_card,2017-03-29 15:11:52

In [3]:
# Get number of total orders placed in dataframe
sneakers_df.count()

order_id          5000
shop_id           5000
user_id           5000
order_amount      5000
total_items       5000
payment_method    5000
created_at        5000
dtype: int64

In [4]:
# Calculate total order_amount
order_amount = sneakers_df["order_amount"].sum()
order_amount

15725640

In [5]:
# Calculate/ confirm average order value (AOC) = Revenue / total orders placed
AOC = order_amount/5000
AOC

3145.128

In [6]:
# Get number of total items with a "total_items" number over 10

High_order = sneakers_df.loc[(sneakers_df["total_items"] > 10)]
High_order

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 4:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 4:00:00
1104,1105,42,607,704000,2000,credit_card,2017-03-24 4:00:00
1362,1363,42,607,704000,2000,credit_card,2017-03-15 4:00:00
1436,1437,42,607,704000,2000,credit_card,2017-03-11 4:00:00
1562,1563,42,607,704000,2000,credit_card,2017-03-19 4:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 4:00:00
2153,2154,42,607,704000,2000,credit_card,2017-03-12 4:00:00
2297,2298,42,607,704000,2000,credit_card,2017-03-07 4:00:00
2835,2836,42,607,704000,2000,credit_card,2017-03-28 4:00:00
2969,2970,42,607,704000,2000,credit_card,2017-03-28 4:00:00
3332,3333,42,607,704000,2000,credit_card,2017-03-24 4:00:00
4056,4057,42,607,704000,2000,credit_card,2017-03-28 4:00:00
4646,4647,42,607,704000,2000,credit_card,2017-03-02 4:00:00
4868,4869,42,607,704000,2000,credit_card,2017-03-22 4:00:00
4882,4883,42,607,704000,2000,credit_card,2017-03-25 4:00:00

In [7]:
High_order.count()

order_id          17
shop_id           17
user_id           17
order_amount      17
total_items       17
payment_method    17
created_at        17
dtype: int64

In [8]:
new_sneakers_df = sneakers_df.copy()
new_sneakers_df.head(20)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
5,6,58,882,138,1,credit_card,2017-03-14 15:25:01
6,7,87,915,149,1,cash,2017-03-01 21:37:57
7,8,22,761,292,2,cash,2017-03-08 2:05:38
8,9,64,914,266,2,debit,2017-03-17 20:56:50
9,10,52,788,146,1,credit_card,2017-03-30 21:08:26
10,11,66,848,322,2,credit_card,2017-03-26 23:36:40
11,12,40,983,322,2,debit,2017-03-12 17:58:30
12,13,54,799,266,2,credit_card,2017-03-16 14:15:34
13,14,100,709,111,1,cash,2017-03-22 2:39:49
14,15,87,849,447,3,credit_card,2017-03-10 11:23:18
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
16,17,17,731,176,1,cash,2017-03-21 4:23:38
17,18,28,752,164,1,credit_card,2017-03-21 12:09:07
18,19,83,761,258,2,cash,2017-03-17 13:18:47
19,20,63,898,408,3,credit_card,2017-03-29 15:11:52

In [9]:
# Remove high items from dataframe
# https://www.geeksforgeeks.org/drop-rows-from-the-dataframe-based-on-certain-condition-applied-on-a-column/?ref=lbp
new_sneakers_df.drop(new_sneakers_df[new_sneakers_df['total_items'] > 20].index, inplace = True)

In [10]:
new_sneakers_df.head(20)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
5,6,58,882,138,1,credit_card,2017-03-14 15:25:01
6,7,87,915,149,1,cash,2017-03-01 21:37:57
7,8,22,761,292,2,cash,2017-03-08 2:05:38
8,9,64,914,266,2,debit,2017-03-17 20:56:50
9,10,52,788,146,1,credit_card,2017-03-30 21:08:26
10,11,66,848,322,2,credit_card,2017-03-26 23:36:40
11,12,40,983,322,2,debit,2017-03-12 17:58:30
12,13,54,799,266,2,credit_card,2017-03-16 14:15:34
13,14,100,709,111,1,cash,2017-03-22 2:39:49
14,15,87,849,447,3,credit_card,2017-03-10 11:23:18
16,17,17,731,176,1,cash,2017-03-21 4:23:38
17,18,28,752,164,1,credit_card,2017-03-21 12:09:07
18,19,83,761,258,2,cash,2017-03-17 13:18:47
19,20,63,898,408,3,credit_card,2017-03-29 15:11:52
20,21,66,987,322,2,cash,2017-03-30 20:11:59

In [11]:
new_sneakers_df.count()

order_id          4983
shop_id           4983
user_id           4983
order_amount      4983
total_items       4983
payment_method    4983
created_at        4983
dtype: int64

In [12]:
# Calculate NEW total order_amount
order_amount = new_sneakers_df["order_amount"].sum()
order_amount

3757640

In [13]:
# Calculate/ confirm NEW average order value (AOC) = Revenue / total orders placed
AOC = order_amount/4983
AOC

754.0919125025085